# <center>Pandas Python Library for Beginners in Data Science
#### <center>Instructor: Vinita Silaparasetty

### Import Libraries

In [1]:
import numpy as np
import pandas as pd

# <center> Creating a Series

<img src="https://github.com/VinitaSilaparasetty/Coursera-Pandas-for-Beginners/blob/master/Media/series.png?raw=true" width="600" height="600">

### <center> Method 1: Using an Array

In [2]:
s = ([1, np.nan, 'Pandas Library'])
s1 = pd.Series(s)
s1

0                 1
1               NaN
2    Pandas Library
dtype: object

## <center>üèÜ Challenge

Create a Pandas Series, named s2, containing the following:

* Integer = 2

* Nan value

* Character = b

In [3]:
s = ([2, np.nan, 'b'])
s2 = pd.Series(s)
s2

0      2
1    NaN
2      b
dtype: object

### <center> Method 2: Using a List

In [4]:
List1 = ['animal','2','animal']
s3 = pd.Series(List1)
s3

0    animal
1         2
2    animal
dtype: object

## <center>üèÜ Challenge

Create a Pandas Series, named s4.
Use a list, named list2, containing the following:

* Integer = 3

* Character = c

* String = Numpy 

Note:'N' Must be capital

In [5]:
list2 = [3 , 'c', 'Numpy']
s4 = pd.Series(list2)
s4

0        3
1        c
2    Numpy
dtype: object

### <center> Method 3: Using a Dictionary

In [6]:
s5 = pd.Series({
    'A':1,
    '3':'Python',
})
s5

A         1
3    Python
dtype: object

## <center>üèÜ Challenge

Create a Pandas Series, named s6, containing the following:

* 'Integer' = 3
* 'B' = Boys

In [7]:
s6= pd.Series({
    'integer':3,
    'B':'Boys',
})
s6

integer       3
B          Boys
dtype: object

# <center> Creating Data Frames

<img src="https://github.com/VinitaSilaparasetty/Coursera-Pandas-for-Beginners/blob/master/Media/dataframe.gif?raw=true" width="600" height="600">

### <center> Method 1: Passing a Numpy Array

In [8]:
df = pd.DataFrame(np.random.randn(6,4))
df

          0         1         2         3
0  0.065767  0.286543  1.546122  0.588412
1  0.299418  1.132245  0.408744  0.559315
2 -1.028614 -2.009850  0.476174 -0.761676
3 -0.801227 -0.400110 -1.416897  0.367408
4 -0.621566  1.934078  1.079144  0.130160
5  1.203188  0.076254  0.827289  0.333712

## <center>üèÜ Challenge

Create a data frame, named df1, which contains:

* A randomly generated array with the dimensions 3x3.

In [9]:
df1 = pd.DataFrame(np.random.randn(3,3))
df1

          0         1         2
0 -0.052641  0.089508  1.258814
1  0.426750  0.358388  1.966995
2 -0.750102  0.549106  0.025449

### <center> Method 2: Passing a Dictionary of Objects

In [10]:
df2 = pd.DataFrame({
    'A':1,
    'number':np.array([6]*3,dtype='int32'),
})
df2

   A  number
0  1       6
1  1       6
2  1       6

## <center>üèÜ Challenge

Create a data frame, named df3, which contains:

* 'E' = np.array([4] * 5,dtype='int32')

* 'Day' = 2

In [11]:
df3 = pd.DataFrame({
    'E':np.array([4]*5,dtype='int32'),
    'Day':2,
})
df3

   E  Day
0  4    2
1  4    2
2  4    2
3  4    2
4  4    2

--------

## <center> Importing Files

### Import .csv files

Use the file path: /home/rhyme/Desktop/Project/

(Note: If you want to use this command for a file on your own system, be sure to use the correct file path.)

In [12]:
df4 = pd.read_csv('/home/rhyme/Desktop/Project/practicedata.csv')
df4.head()

          A         B         C         D
0       NaN -1.604969 -0.106263 -1.002924
1 -0.404667  0.458565 -1.174912       NaN
2  0.440231  1.713480  0.162473 -1.632132
3  0.081050  0.639851  0.844037  1.463154
4 -1.013616 -0.224553  1.786915  1.041241

### Import .csv files

Use the file path: /home/rhyme/Desktop/Project/

(Note: If you want to use this command for a file on your own system, be sure to use the correct file path.)

-----------------

## <center>üèÜ Challenge
    
Import the file practicedata.json in the dataframe df5.

Use the file path: /home/rhyme/Desktop/Project/

In [13]:
df5 = pd.read_json('/home/rhyme/Desktop/Project/practicedata.json')
df5.head()

          A         B         C         D
0       NaN -1.604969 -0.106263 -1.002924
1 -0.404667  0.458565 -1.174912       NaN
2  0.440231  1.713480  0.162473 -1.632132
3  0.081050  0.639851  0.844037  1.463154
4 -1.013616 -0.224553  1.786915  1.041241

### Importing Files from a url

Import data from this github repo: https://raw.githubusercontent.com/VinitaSilaparasetty/Coursera-Pandas-for-Beginners/master/practicedata.csv")

In [14]:
df6 = pd.read_csv('https://raw.githubusercontent.com/VinitaSilaparasetty/Coursera-Pandas-for-Beginners/master/practicedata.csv')
df6.head()

          A         B         C         D
0       NaN -1.604969 -0.106263 -1.002924
1 -0.404667  0.458565 -1.174912       NaN
2  0.440231  1.713480  0.162473 -1.632132
3  0.081050  0.639851  0.844037  1.463154
4 -1.013616 -0.224553  1.786915  1.041241

### Importing Files from a url

Import data from this github repo: https://raw.githubusercontent.com/VinitaSilaparasetty/Coursera-Pandas-for-Beginners/master/practicedata.csv")

## <center>üèÜ Challenge
    
Create the data frame df7.

Then import data from this github repo: https://raw.githubusercontent.com/VinitaSilaparasetty/Coursera-Pandas-for-Beginners/master/practicedata.json

In [15]:
df7 = pd.read_json('https://raw.githubusercontent.com/VinitaSilaparasetty/Coursera-Pandas-for-Beginners/master/practicedata.json')
df7.head()

          A         B         C         D
0       NaN -1.604969 -0.106263 -1.002924
1 -0.404667  0.458565 -1.174912       NaN
2  0.440231  1.713480  0.162473 -1.632132
3  0.081050  0.639851  0.844037  1.463154
4 -1.013616 -0.224553  1.786915  1.041241

## <center> Export Files

### Export .csv Files

In [16]:
df4.to_csv('/home/rhyme/Desktop/Project/practicedata2.csv')

## <center>üèÜ Challenge

Export the data from df4 to 'practicedata2.json'

Use the file path:/home/rhyme/Desktop/Project/

In [17]:
df4.to_json('/home/rhyme/Desktop/Project/practicedata2.json')

## <center>Data Summary
    
We will be working with data frame df6 for this section.

In [18]:
#first run this cell to create the data frame df6
df6 = pd.read_csv("https://raw.githubusercontent.com/VinitaSilaparasetty/Coursera-Pandas-for-Beginners/master/practicedata.csv")
df6

          A         B         C         D
0       NaN -1.604969 -0.106263 -1.002924
1 -0.404667  0.458565 -1.174912       NaN
2  0.440231  1.713480  0.162473 -1.632132
3  0.081050  0.639851  0.844037  1.463154
4 -1.013616 -0.224553  1.786915  1.041241
5 -1.013616 -0.224553  1.786915  1.041241
6 -0.488965  0.946528  0.829525 -0.529912
7 -0.488965  0.946528  0.829525 -0.529912

### Quick Summary of Data

In [19]:
df6.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       7 non-null      float64
 1   B       8 non-null      float64
 2   C       8 non-null      float64
 3   D       7 non-null      float64
dtypes: float64(4)
memory usage: 384.0 bytes

### Detailed Summary of Data

In [20]:
df6.describe()

              A         B         C         D
count  7.000000  8.000000  8.000000  7.000000
mean  -0.412650  0.331360  0.619777 -0.021321
std    0.533101  1.010369  0.987050  1.192849
min   -1.013616 -1.604969 -1.174912 -1.632132
25%   -0.751291 -0.224553  0.095289 -0.766418
50%   -0.488965  0.549208  0.829525 -0.529912
75%   -0.161808  0.946528  1.079757  1.041241
max    0.440231  1.713480  1.786915  1.463154

## <center>View Columns

In [21]:
df6.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

## <center>üèÜ Challenge
    
View the columns in df7.

In [22]:
#first run this cell to create the data frame df7
df7 = pd.read_json("https://raw.githubusercontent.com/VinitaSilaparasetty/Coursera-Pandas-for-Beginners/master/practicedata.json")
df7

          A         B         C         D
0       NaN -1.604969 -0.106263 -1.002924
1 -0.404667  0.458565 -1.174912       NaN
2  0.440231  1.713480  0.162473 -1.632132
3  0.081050  0.639851  0.844037  1.463154
4 -1.013616 -0.224553  1.786915  1.041241
5 -1.013616 -0.224553  1.786915  1.041241
6 -0.488965  0.946528  0.829525 -0.529912
7 -0.488965  0.946528  0.829525 -0.529912

In [23]:
df7.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

## <center>View Datatypes

In [24]:
df6.dtypes

A    float64
B    float64
C    float64
D    float64
dtype: object

## <center>üèÜ Challenge
    
View the datatypes in df7

In [25]:
df7.dtypes

A    float64
B    float64
C    float64
D    float64
dtype: object

## <center>Handling Duplicates

### Detect Duplicate Rows

In [26]:
df6.duplicated()

0    False
1    False
2    False
3    False
4    False
5     True
6    False
7     True
dtype: bool

### Drop Duplicate Rows

In [27]:
df6.drop_duplicates()

          A         B         C         D
0       NaN -1.604969 -0.106263 -1.002924
1 -0.404667  0.458565 -1.174912       NaN
2  0.440231  1.713480  0.162473 -1.632132
3  0.081050  0.639851  0.844037  1.463154
4 -1.013616 -0.224553  1.786915  1.041241
6 -0.488965  0.946528  0.829525 -0.529912

## <center>üèÜ Challenge
    
Detect and drop duplicates in df7

In [28]:
df7.duplicated()

0    False
1    False
2    False
3    False
4    False
5     True
6    False
7     True
dtype: bool

In [29]:
df.drop_duplicates()

          0         1         2         3
0  0.065767  0.286543  1.546122  0.588412
1  0.299418  1.132245  0.408744  0.559315
2 -1.028614 -2.009850  0.476174 -0.761676
3 -0.801227 -0.400110 -1.416897  0.367408
4 -0.621566  1.934078  1.079144  0.130160
5  1.203188  0.076254  0.827289  0.333712

## <center>Handling Missing Values

### Detect Missing Values

In [30]:
print(df6.isnull().sum())

A    1
B    0
C    0
D    1
dtype: int64

### Drop Missing Values

In [31]:
df6.dropna()

          A         B         C         D
2  0.440231  1.713480  0.162473 -1.632132
3  0.081050  0.639851  0.844037  1.463154
4 -1.013616 -0.224553  1.786915  1.041241
5 -1.013616 -0.224553  1.786915  1.041241
6 -0.488965  0.946528  0.829525 -0.529912
7 -0.488965  0.946528  0.829525 -0.529912

## <center>üèÜ Challenge
    
Detect and drop missing values in df7

In [40]:
#Detect missing values
print(df7.isnull().sum())

A    1
B    0
C    0
D    1
dtype: int64

In [41]:
#Drop missing values
df7.dropna()

          A         B         C         D
2  0.440231  1.713480  0.162473 -1.632132
3  0.081050  0.639851  0.844037  1.463154
4 -1.013616 -0.224553  1.786915  1.041241
5 -1.013616 -0.224553  1.786915  1.041241
6 -0.488965  0.946528  0.829525 -0.529912
7 -0.488965  0.946528  0.829525 -0.529912

## <center>Numeric Operations

We will work with the data frame df8.

In [34]:
#first run this cell to create the dataframe df8
df8 = pd.DataFrame(np.random.randn(6,4))
df8

          0         1         2         3
0  0.977202 -0.504516 -0.950181 -1.144113
1  0.432413  0.612953 -1.287802  0.044995
2  1.102871 -0.786447  0.409527  0.321103
3 -1.472256  0.022088 -0.209906 -0.514932
4  1.603528  0.426386  0.612038  0.141265
5 -1.288743 -2.065931 -0.017183 -1.245912

### Calculate the Mean:

In [42]:
#first run this cell to create df8
df8 = pd.DataFrame(np.random.randn(6,4))
df8

          0         1         2         3
0 -1.037340 -0.583597 -0.702287  0.627027
1 -1.343213  0.797761 -0.198052  0.273905
2 -1.871819 -0.148459 -0.582644  0.250315
3  1.099494  0.089559 -0.398922  0.785294
4  1.983620  1.239267 -2.226213 -0.479454
5 -0.308385  0.153451 -1.307361 -0.553504

In [43]:
df8.mean()

0   -0.246274
1    0.257997
2   -0.902580
3    0.150597
dtype: float64

## <center>üèÜ Challenge
    
Calculate the mean of df9

In [44]:
#first run this cell to create df9
df9 = pd.DataFrame(np.random.randn(3,4))
df9

          0         1         2         3
0  2.071473  0.053083 -0.951648  1.020836
1  0.076284 -0.432207  0.561670  0.310638
2  0.617567  0.669586 -0.169279  0.330989

In [45]:
df9.mean()

0    0.921775
1    0.096821
2   -0.186419
3    0.554155
dtype: float64

### Calculate the Cumulative Sum:

In [46]:
df8.apply(np.cumsum)

          0         1         2         3
0 -1.037340 -0.583597 -0.702287  0.627027
1 -2.380553  0.214164 -0.900339  0.900932
2 -4.252371  0.065705 -1.482983  1.151247
3 -3.152877  0.155264 -1.881905  1.936541
4 -1.169257  1.394530 -4.108118  1.457087
5 -1.477642  1.547982 -5.415479  0.903583

## <center>üèÜ Challenge
    
Calculate the cumulative sum of df9

In [47]:
df9.apply(np.cumsum)

          0         1         2         3
0  2.071473  0.053083 -0.951648  1.020836
1  2.147757 -0.379124 -0.389978  1.331474
2  2.765324  0.290462 -0.559257  1.662464

### Find the Maximum Value:

In [48]:
df8.max()

0    1.983620
1    1.239267
2   -0.198052
3    0.785294
dtype: float64

## <center>üèÜ Challenge

Find the maximum value of df9

In [49]:
df9.max()

0    2.071473
1    0.669586
2    0.561670
3    1.020836
dtype: float64

### Find the Minimum Value:

In [50]:
df8.min()

0   -1.871819
1   -0.583597
2   -2.226213
3   -0.553504
dtype: float64

## <center>üèÜ Challenge

Find the minimum value of df9

In [51]:
df9.min()

0    0.076284
1   -0.432207
2   -0.951648
3    0.310638
dtype: float64

## <center>String Manipulation

We will work with the series s7 for this section.

In [52]:
#first run this cell to create series s7
s7 = np.array(['animal','bird',' Pandas Library  '] )
s7= pd.Series(s7)
s7

0               animal
1                 bird
2     Pandas Library
dtype: object

### Convert to Lower Case

In [53]:
s7.str.lower()

0               animal
1                 bird
2     pandas library
dtype: object

## <center>üèÜ Challenge

Convert the strings in s8 to lower case.

In [54]:
#first run this cell to create series s8
s8 = np.array(['cat','dog','Python Programming'] )
s8= pd.Series(s8)
s8

0                   cat
1                   dog
2    Python Programming
dtype: object

In [55]:
s8.str.lower()

0                   cat
1                   dog
2    python programming
dtype: object

---------------

### Convert to Upper Case

In [56]:
s7.str.upper()

0               ANIMAL
1                 BIRD
2     PANDAS LIBRARY
dtype: object

## <center>üèÜ Challenge

Convert the strings in s8 to upper case.

In [57]:
s8.str.upper()

0                   CAT
1                   DOG
2    PYTHON PROGRAMMING
dtype: object

### Swap Capitalization

In [58]:
# Lower case become upper case and vice-versa\
s7.str.swapcase()

0               ANIMAL
1                 BIRD
2     pANDAS lIBRARY
dtype: object

## <center>üèÜ Challenge

Swap the capitalization of the strings in s8.

In [59]:
s8.str.swapcase()

0                   CAT
1                   DOG
2    pYTHON pROGRAMMING
dtype: object

### Find Length of String

In [61]:
s7.str.len()

0     6
1     4
2    17
dtype: int64

## <center>üèÜ Challenge

Find the length of the strings in s8.

In [62]:
s8.str.len()

0     3
1     3
2    18
dtype: int64

-------------

### Split String

In [63]:
s7.str.split()

0             [animal]
1               [bird]
2    [Pandas, Library]
dtype: object

## <center>üèÜ Challenge

Find the length of the strings in s8.

In [64]:
#first run this cell to create the series s8
s8 = np.array(['cat','dog',' Python Programming  '] )
s8= pd.Series(s8)
s8

0                      cat
1                      dog
2     Python Programming
dtype: object

In [65]:
s8.str.split()

0                    [cat]
1                    [dog]
2    [Python, Programming]
dtype: object

### Detect Unique Values

In [66]:
s7.unique()

array(['animal', 'bird', ' Pandas Library  '], dtype=object)

## <center>üèÜ Challenge

Detect unique values in s8.

In [67]:
s8.unique()

array(['cat', 'dog', ' Python Programming  '], dtype=object)

### Repeat String

We will work with the series s7 for this section.

In [68]:
#first run this cell to create series s7
s7 = np.array(['animal','bird',' Pandas Library  '] )
s7= pd.Series(s7)
s7

0               animal
1                 bird
2     Pandas Library
dtype: object

In [69]:
repeat_list = [2,3,2]
s7.str.repeat(repeat_list)

0                          animalanimal
1                          birdbirdbird
2     Pandas Library   Pandas Library
dtype: object

## <center>üèÜ Challenge

Repeat the values in s8 in the order [1,2,3]

In [73]:
s8 = np.array(['cat', 'dog', 'Python Programming'])
s8 = pd.Series(s8)
s8

0                   cat
1                   dog
2    Python Programming
dtype: object

In [74]:
repeat_list =[1,2,3]
s8.str.repeat(repeat_list)

0                                                  cat
1                                               dogdog
2    Python ProgrammingPython ProgrammingPython Pro...
dtype: object